---
kind: property
id: P:Autodesk.Revit.DB.DefaultDivideSettings.PathLayout
source: html/f945b3cf-7725-41b2-75ac-ff0f3cf60d42.htm
---
# Autodesk.Revit.DB.DefaultDivideSettings.PathLayout Property

A default Divided Path layout.

## Syntax (C#)
```csharp
public SpacingRuleLayout PathLayout { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration